[
  "A group of flamingos is called a 'flamboyance.'",
  "Bananas are berries, but strawberries aren't.",
  "Octopuses have three hearts and blue blood.",
  "Honey never spoils. Archaeologists have found 3,000-year-old honey that's still good.",
  "The world's most expensive coffee comes from beans that have been eaten and excreted by civet cats.",
  "Golf is the only sport played on the Moon.",
  "The voice of Mickey Mouse was married to the voice of Minnie Mouse in real life.",
  "A day on Venus is longer than a year on Venus.",
  "Wombat poop is cube-shaped.",
  "There is a basketball court on the top floor of the U.S. Supreme Court Building, known as the 'Highest Court in the Land.'",
  "Japan has over 5 million vending machines, selling everything from fresh eggs to hot soup.",
  "In Switzerland, it's illegal to own just one guinea pig. You must have at least two because they're social animals.",
  "Pineapples take about two years to grow.",
  "The Eiffel Tower can grow taller in the summer due to metal expansion from heat.",
  "There is a species of jellyfish that is biologically immortal.",
  "The inventor of the frisbee was turned into a frisbee after he died.",
  "The dot over the lowercase 'i' and 'j' is called a tittle.",
  "Sharks predate trees. They’ve been around for over 400 million years.",
  "A day on Mars is only about 40 minutes longer than a day on Earth.",
  "There’s an island in Japan that’s home to more cats than people.",
  "Butterflies can taste with their feet.",
  "Some turtles can breathe through their butts.",
  "The Great Wall of China is held together with sticky rice mortar.",
  "Your heart beats over 100,000 times per day.",
  "The longest wedding veil was longer than 63 football fields.",
  "A single strand of spaghetti is called a 'spaghetto.'",
  "The 'M’s' in M&M’s stand for 'Mars' and 'Murrie,' the last names of the candy's creators.",
  "There’s a town in Norway where the sun doesn’t set for 2.5 months during the summer.",
  "Before alarm clocks, there were 'knocker-uppers' who would tap on people's windows to wake them up.",
  "Cows have best friends and get stressed when they are separated.",
  "Walt Disney was afraid of mice.",
  "A flock of crows is called a 'murder.'",
  "Sonic the Hedgehog's full name is 'Ogilvie Maurice Hedgehog.'",
  "The man who voiced Optimus Prime also voiced Eeyore in Winnie the Pooh.",
  "A crocodile cannot stick its tongue out.",
  "More people own pet tigers in the U.S. than exist in the wild globally.",
  "Avocados are poisonous to birds.",
  "There’s a basketball court on the top floor of the U.S. Supreme Court Building, known as the 'Highest Court in the Land.'",
  "McDonald's once created bubblegum-flavored broccoli.",
  "The hashtag symbol is technically called an octothorpe.",
  "The speed of a computer mouse is measured in 'Mickeys per second.'",
  "A newborn baby panda is about the size of a stick of butter.",
  "There’s an island in Japan that’s home to more rabbits than people.",
  "The first oranges weren’t orange – they were originally green.",
  "Sloths can hold their breath longer than dolphins can.",
  "A shrimp's heart is located in its head.",
  "Some cats are allergic to humans.",
  "Snoop Dogg once tried to rent an entire country for a music video.",
  "Cleopatra lived closer in time to the Moon landing than to the building of the Great Pyramid.",
  "Vending machines kill more people each year than sharks do.",
  "Tomatoes were once thought to be poisonous in Europe.",
  "Jellyfish have survived five mass extinctions.",
  "There's a species of fungus that can control the minds of ants.",
  "The Guinness World Record for the longest hiccup spree lasted 68 years.",
  "The inventor of the Pringles can is buried in one.",
  "The Statue of Liberty's fingernail is about the size of a person.",
  "Cows moo in regional accents.",
  "Koalas have fingerprints that are almost indistinguishable from human fingerprints.",
  "There's a jellyfish that can live forever by reverting to an earlier stage in its life cycle.",
  "Ants stretch in the morning when they wake up.",
  "You can hear a blue whale’s heartbeat from two miles away.",
  "Rabbits can’t puke.",
  "Octopuses can change color while dreaming.",
  "Bubble wrap was originally designed to be wallpaper.",
  "A day on Mercury is longer than a year on Mercury.",
  "Pope Francis used to work as a nightclub bouncer.",
  "The first film ever shown on the White House lawn was 'E.T.' in 1982.",
  "There’s a town in Canada that gets so cold, people leave their cars running all winter.",
  "If you shuffle a deck of cards, it’s likely that no one has ever shuffled them in that exact order before."
]
